7767517
113 147
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=32 1=3 -23310=1,1.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 9=2
Convolution              convrelu_1               1 1 1 2 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432 9=2
Split                    splitncnn_0              1 2 2 3 4
Convolution              convrelu_2               1 1 3 5 0=32 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=2
Split                    splitncnn_1              1 2 5 6 7
Convolution              convrelu_3               1 1 7 8 0=32 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=2
Split                    splitncnn_2              1 2 8 9 10
Convolution              convrelu_5               1 1 4 11 0=32 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=2
Convolution              convrelu_4               1 1 10 12 0=32 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=2
Concat                   cat_0                    4 1 12 9 6 11 13 0=0
Convolution              convrelu_6               1 1 13 14 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=2
Pooling                  maxpool2d_113            1 1 14 15 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Split                    splitncnn_3              1 2 15 16 17
Convolution              convrelu_7               1 1 16 18 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=2
Split                    splitncnn_4              1 2 18 19 20
Convolution              convrelu_8               1 1 20 21 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_5              1 2 21 22 23
Convolution              convrelu_10              1 1 17 24 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=2
Convolution              convrelu_9               1 1 23 25 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Concat                   cat_1                    4 1 25 22 19 24 26 0=0
Convolution              convrelu_11              1 1 26 27 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Split                    splitncnn_6              1 2 27 28 29
Pooling                  maxpool2d_114            1 1 29 30 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Split                    splitncnn_7              1 2 30 31 32
Convolution              convrelu_12              1 1 31 33 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=2
Split                    splitncnn_8              1 2 33 34 35
Convolution              convrelu_13              1 1 35 36 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=2
Split                    splitncnn_9              1 2 36 37 38
Convolution              convrelu_15              1 1 32 39 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=2
Convolution              convrelu_14              1 1 38 40 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=2
Concat                   cat_2                    4 1 40 37 34 39 41 0=0
Convolution              convrelu_16              1 1 41 42 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Split                    splitncnn_10             1 2 42 43 44
Pooling                  maxpool2d_115            1 1 44 45 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Split                    splitncnn_11             1 2 45 46 47
Convolution              convrelu_17              1 1 46 48 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=2
Split                    splitncnn_12             1 2 48 49 50
Convolution              convrelu_18              1 1 50 51 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=2
Split                    splitncnn_13             1 2 51 52 53
Convolution              convrelu_20              1 1 47 54 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=2
Convolution              convrelu_19              1 1 53 55 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=2
Concat                   cat_3                    4 1 55 52 49 54 56 0=0
Convolution              convrelu_21              1 1 56 57 0=512 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=2
Split                    splitncnn_14             1 2 57 58 59
Convolution              convrelu_22              1 1 58 60 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Split                    splitncnn_15             1 4 60 61 62 63 64
Pooling                  maxpool2d_118            1 1 62 65 0=0 1=13 11=13 12=1 13=6 2=1 3=6 5=1
Pooling                  maxpool2d_117            1 1 63 66 0=0 1=9 11=9 12=1 13=4 2=1 3=4 5=1
Pooling                  maxpool2d_116            1 1 64 67 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 65 66 67 61 68 0=0
Convolution              convrelu_24              1 1 59 69 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Convolution              convrelu_23              1 1 68 70 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=2
Concat                   cat_5                    2 1 70 69 71 0=0
Convolution              convrelu_25              1 1 71 72 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Split                    splitncnn_16             1 2 72 73 74
Convolution              convrelu_26              1 1 74 75 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Interp                   upsample_119             1 1 75 76 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              convrelu_27              1 1 43 77 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Concat                   cat_6                    2 1 77 76 78 0=0
Split                    splitncnn_17             1 2 78 79 80
Convolution              convrelu_28              1 1 79 81 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=2
Split                    splitncnn_18             1 2 81 82 83
Convolution              convrelu_29              1 1 83 84 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_19             1 2 84 85 86
Convolution              convrelu_31              1 1 80 87 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=2
Convolution              convrelu_30              1 1 86 88 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Concat                   cat_7                    4 1 88 85 82 87 89 0=0
Convolution              convrelu_32              1 1 89 90 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Split                    splitncnn_20             1 2 90 91 92
Convolution              convrelu_33              1 1 92 93 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=2
Interp                   upsample_120             1 1 93 94 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              convrelu_34              1 1 28 95 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=2
Concat                   cat_8                    2 1 95 94 96 0=0
Split                    splitncnn_21             1 2 96 97 98
Convolution              convrelu_35              1 1 97 99 0=32 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=2
Split                    splitncnn_22             1 2 99 100 101
Convolution              convrelu_36              1 1 101 102 0=32 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=2
Split                    splitncnn_23             1 2 102 103 104
Convolution              convrelu_38              1 1 98 105 0=32 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=2
Convolution              convrelu_37              1 1 104 106 0=32 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=2
Concat                   cat_9                    4 1 106 103 100 105 107 0=0
Convolution              convrelu_39              1 1 107 108 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=2
Split                    splitncnn_24             1 2 108 109 110
Convolution              convrelu_40              1 1 110 111 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 9=2
Concat                   cat_10                   2 1 111 91 112 0=0
Split                    splitncnn_25             1 2 112 113 114
Convolution              convrelu_41              1 1 113 115 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=2
Split                    splitncnn_26             1 2 115 116 117
Convolution              convrelu_42              1 1 117 118 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_27             1 2 118 119 120
Convolution              convrelu_44              1 1 114 121 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=2
Convolution              convrelu_43              1 1 120 122 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Concat                   cat_11                   4 1 122 119 116 121 123 0=0
Convolution              convrelu_45              1 1 123 124 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Split                    splitncnn_28             1 2 124 125 126
Convolution              convrelu_46              1 1 126 127 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912 9=2
Concat                   cat_12                   2 1 127 73 128 0=0
Split                    splitncnn_29             1 2 128 129 130
Convolution              convrelu_47              1 1 129 131 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=2
Split                    splitncnn_30             1 2 131 132 133
Convolution              convrelu_48              1 1 133 134 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=2
Split                    splitncnn_31             1 2 134 135 136
Convolution              convrelu_50              1 1 130 137 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=2
Convolution              convrelu_49              1 1 136 138 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=2
Concat                   cat_13                   4 1 138 135 132 137 139 0=0
Convolution              convrelu_52              1 1 109 140 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=2
Convolution              conv_55                  1 1 140 out0 0=255 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32640
Convolution              convrelu_53              1 1 125 142 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
Convolution              conv_56                  1 1 142 out1 0=255 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65280
Convolution              convrelu_51              1 1 139 144 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Convolution              convrelu_54              1 1 144 145 0=512 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
Convolution              conv_57                  1 1 145 out2 0=255 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=130560
